Revit 2017 API
AssetPropertyEnum Class
 Represents a property of enum value.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyEnum : AssetProperty
Visual Basic
Public Class AssetPropertyEnum _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyEnum : public AssetProperty
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyEnum
See Also
AssetPropertyEnum Members
Autodesk.Revit.Utility Namespace